Загрузка

In [1]:
import pandas as pd
import numpy as np

In [15]:
import sqlite3
print(sqlite3.sqlite_version)

3.31.1

In [10]:
data = pd.read_csv('/Users/annie/github/kaggle_ecommerce_data.csv', encoding='cp1252')

In [17]:
data.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
210278,555277,84596G,SMALL CHOCOLATES PINK BOWL,1,2011-06-01 17:30:00,0.83,NaN,United Kingdom
165429,550798,22303,COFFEE MUG APPLES DESIGN,36,2011-04-20 14:41:00,2.55,15290.0,United Kingdom
320959,565118,47599B,BLUE PARTY BAGS,1,2011-09-01 11:33:00,2.10,15039.0,United Kingdom
88752,543815,21124,SET/10 BLUE POLKADOT PARTY CANDLES,2,2011-02-13 15:18:00,1.25,17255.0,United Kingdom
198692,554061,22197,SMALL POPCORN HOLDER,20,2011-05-20 16:56:00,0.85,18008.0,United Kingdom

In [16]:
data['InvoiceDate'] = pd.to_datetime(data['InvoiceDate'],format='%m/%d/%Y %H:%M')

In [18]:
conn = sqlite3.connect('db')
cur = conn.cursor()

In [19]:
def select(sql):
  return pd.read_sql(sql, conn)

In [20]:
data.to_sql('ecommerce', conn, index=False)

In [30]:
sql = '''select count(*) from ecommerce t'''
print(select(sql), len(data))

   count(*)
0    541909 541909

In [31]:
type(select(sql))

pandas.core.frame.DataFrame

In [35]:
sql = '''select * from ecommerce t limit 5'''
select(sql)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [36]:
select(sql).dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

Анализ - RFM сегментация